{
  "backend/main.mo": "Motoko backend managing artworks with create, read, list, and delete functions plus user-based access control and blob storage integration.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, tests, and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color tokens and global styling.",
  "frontend/index.html": "Root HTML file loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with Home, Gallery, and Studio routes wrapped in AppLayout.",
  "frontend/src/components/auth/AuthButton.tsx": "Login/logout button using Internet Identity with loading states and error recovery.",
  "frontend/src/components/effects/ConfettiOverlay.tsx": "Fullscreen canvas overlay rendering animated confetti pieces.",
  "frontend/src/components/gallery/HeroTile.tsx": "Hero tile displaying hero image with error fallback, lock state, and styled hover effects.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout with fixed auth button, routed content, and a styled footer with attribution.",
  "frontend/src/components/premium/UnlockHeroDialog.tsx": "Dialog that lets users unlock a hero by watching an ad, tracks watch progress, and triggers unlock callbacks.",
  "frontend/src/components/saves/MySavesDialog.tsx": "Displays the user's saved artworks with options to download or delete, requiring sign‑in for access.",
  "frontend/src/components/studio/BrushControls.tsx": "Provides brush size adjustment, eraser toggle, and clear actions for the drawing tool.",
  "frontend/src/components/studio/ColorPalette.tsx": "Renders a selectable color palette and notifies when a new color is chosen.",
  "frontend/src/components/studio/DrawingSurface.tsx": "Canvas drawing component that loads a template image, tracks strokes, and supports clearing and exporting.",
  "frontend/src/components/studio/FinishSaveButton.tsx": "Button that exports the drawing and either saves it to the backend or downloads it locally, with loading and error states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries on changes.",
  "frontend/src/hooks/useArtworks.ts": "Provides CRUD helpers for artworks using underlying query hooks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity state, login, logout, and status tracking via AuthClient.",
  "frontend/src/hooks/usePremiumUnlocks.ts": "Manages premium hero unlocks using localStorage and clears them when the user logs out, exposing helpers to check and unlock heroes.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for fetching and mutating artwork data, including listing, retrieving, creating, and deleting artworks.",
  "frontend/src/hooks/useVibration.ts": "Provides a simple hook to trigger predefined vibration patterns using the Web Vibration API.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom theme variables, hero-related colors, and various utility classes for styling the UI.",
  "frontend/src/lib/heroes.ts": "Exports a list of hero definitions with IDs, names, template paths, and premium status.",
  "frontend/src/main.tsx": "Bootstraps the React app, configuring React Query and the Internet Identity provider before rendering App.",
  "frontend/src/pages/GalleryPage.tsx": "Displays the hero selection grid, handles premium unlock flow, navigation, and shows user save dialogs.",
  "frontend/src/pages/HomePage.tsx": "Renders the home screen with animated branding and a button navigating to the gallery to start painting.",
  "frontend/src/pages/StudioPage.tsx": "React page that renders the coloring studio with drawing surface, color/brush controls, eraser, confetti, and hero-specific template handling.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL or hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending fonts, colors, layout, animations, and enabling several plugins.",
  "project_state.json": "JSON describing the project’s state, features, issues, required assets, and architectural notes."
}